FranciscoLlobet/efm32-freertos-zig/csrc/system/cc3100-sdk/examples/nwp_filters/main.c
    _i32                   RetVal = -1;
    SlrxFilterID_t          FilterId = 0;
    SlrxFilterRuleType_t    RuleType = 0;

    _u8                   MacMAsk[SL_MAC_ADDR_LEN]  = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
    _u8                   IPMask[IP_ADDR_LENGTH]   = {0xFF, 0xFF, 0xFF, 0xFF};

    /*************************************************************************/
    /* Build filter to drop incoming packets according to source MAC address */
    /*************************************************************************/

    /* define filter as parent.
     * further filters can be defined as nodes/leafs {1, 2,...} */
    Trigger.ParentFilterID = 0;

    /* no trigger to activate the filter.
     * will  be active upon connection state and role */
    Trigger.Trigger = NO_TRIGGER;

    /* connection state and role */
    Trigger.TriggerArgConnectionState.IntRepresentation = RX_FILTER_CONNECTION_STATE_STA_CONNECTED;
    Trigger.TriggerArgRoleStatus.IntRepresentation = RX_FILTER_ROLE_STA;

    /*header and Combination types are only supported.
    * Combination for logical AND/OR between two filters */
    RuleType = HEADER;

    Rule.HeaderType.RuleHeaderfield = MAC_SRC_ADDRESS_FIELD;
    pal_Memcpy(Rule.HeaderType.RuleHeaderArgsAndMask.RuleHeaderArgs.RxFilterDB6BytesRuleArgs[0],
                                        g_MacAddress , SL_MAC_ADDR_LEN);
    pal_Memcpy(Rule.HeaderType.RuleHeaderArgsAndMask.RuleHeaderArgsMask,
                                        MacMAsk , SL_MAC_ADDR_LEN);

    Rule.HeaderType.RuleCompareFunc = COMPARE_FUNC_EQUAL;

    /* Action */
    Action.ActionType.IntRepresentation = RX_FILTER_ACTION_DROP;

    FilterFlags.IntRepresentation = RX_FILTER_BINARY;

    RetVal = sl_WlanRxFilterAdd(RuleType, FilterFlags, &Rule, &Trigger,
                                                        &Action, &FilterId);
    ASSERT_ON_ERROR(RetVal);

    /*************************************************************************/
    /* Build filter to drop incoming packets according to source IP address  */
    /*************************************************************************/

    /* define filter as parent.
     * further filters can be defined as nodes/leafs {1, 2,...} */
    Trigger.ParentFilterID = 0;

    /* no trigger to activate the filter.
    * will  be active upon connection state and role */
    Trigger.Trigger = NO_TRIGGER;

    /* connection state and role */
    Trigger.TriggerArgConnectionState.IntRepresentation = RX_FILTER_CONNECTION_STATE_STA_CONNECTED;
    Trigger.TriggerArgRoleStatus.IntRepresentation = RX_FILTER_ROLE_STA;

    /*header and Combination types are only supported.
    * Combination for logical AND/OR between two filters */
    RuleType = HEADER;

    Rule.HeaderType.RuleHeaderfield = IPV4_SRC_ADRRESS_FIELD;
    pal_Memcpy(Rule.HeaderType.RuleHeaderArgsAndMask.RuleHeaderArgs.RxFilterDB4BytesRuleArgs[0],
                                                    g_IpAddress , IP_ADDR_LENGTH);
    pal_Memcpy(Rule.HeaderType.RuleHeaderArgsAndMask.RuleHeaderArgsMask,
                                                    IPMask, IP_ADDR_LENGTH);

    Rule.HeaderType.RuleCompareFunc = COMPARE_FUNC_EQUAL;

    /* Action */
    Action.ActionType.IntRepresentation = RX_FILTER_ACTION_DROP;

    FilterFlags.IntRepresentation = RX_FILTER_BINARY;

    RetVal = sl_WlanRxFilterAdd(RuleType, FilterFlags, &Rule, &Trigger,
                                                        &Action, &FilterId);
    ASSERT_ON_ERROR(RetVal);

    return SUCCESS;
}


/*!
    \brief Opening a server side socket and receiving data

    This function opens a TCP socket in Listen mode and waits for an incoming TCP
    connection. If a socket connection is established then the function will try to
    read 1000 TCP packets from the connected client.

    \param[in]          port number on which the server will be listening on

    \return             0 on success, -1 on Error.

    \note               This function will wait for an incoming connection till one
                        is established

    \warning
*/
static _i32 BsdTcpServer(_u16 Port)
{
    SlSockAddrIn_t  Addr;
    SlSockAddrIn_t  LocalAddr;
    SlTimeval_t     timeVal;

    _u16          idx = 0;
    _u16          AddrSize = 0;
    _i16          SockID = 0;
    _i32          Status = -1;
    _i16          newSockID = 0;
    _u16          LoopCount = 0;
    _u16          recvSize = 0;

    for (idx=0 ; idx<BUF_SIZE ; idx++)
    {
        uBuf.BsdBuf[idx] = (_u8)(idx % 10);
    }

    LocalAddr.sin_family = SL_AF_INET;
    LocalAddr.sin_port = sl_Htons((_u16)Port);
    LocalAddr.sin_addr.s_addr = 0;

    SockID = sl_Socket(SL_AF_INET,SL_SOCK_STREAM, 0);
    if( SockID < 0 )
    {
        CLI_Write(" [TCP Server] Create socket Error \n\r");
        ASSERT_ON_ERROR(SockID);
    }

    AddrSize = sizeof(SlSockAddrIn_t);
    Status = sl_Bind(SockID, (SlSockAddr_t *)&LocalAddr, AddrSize);
    if( Status < 0 )
    {
        sl_Close(SockID);
        CLI_Write(" [TCP Server] Socket address assignment Error \n\r");
        ASSERT_ON_ERROR(Status);
    }

    Status = sl_Listen(SockID, 0);
    if( Status < 0 )
    {
        sl_Close(SockID);
        CLI_Write(" [TCP Server] Listen Error \n\r");
        ASSERT_ON_ERROR(Status);
    }

    newSockID = sl_Accept(SockID, ( struct SlSockAddr_t *)&Addr,
                                                    (SlSocklen_t*)&AddrSize);
    if( newSockID < 0 )
    {
        sl_Close(SockID);
        CLI_Write(" [TCP Server] Accept connection Error \n\r");
        ASSERT_ON_ERROR(newSockID);
    }

    timeVal.tv_sec = 1;
    timeVal.tv_usec = 0;
    if( newSockID >= 0 )
    {
        Status = sl_SetSockOpt(newSockID, SL_SOL_SOCKET, SL_SO_RCVTIMEO,
                                &timeVal, sizeof(timeVal));
        if( Status < 0 )
        {
            sl_Close(SockID);
            sl_Close(newSockID);
            CLI_Write(" [TCP Server] set socket option Error \n\r");
            ASSERT_ON_ERROR(Status);
        }
    }

    while (LoopCount < NO_OF_PACKETS)
    {
        recvSize = BUF_SIZE;

        do
        {
            Status = sl_Recv(newSockID, &uBuf.BsdBuf[BUF_SIZE - recvSize], recvSize, 0);
            if( Status <= 0 )
            {
                sl_Close(newSockID);
                sl_Close(SockID);
                CLI_Write(" [TCP Server] Data recv Error \n\r");
                ASSERT_ON_ERROR(TCP_RECV_ERROR);
            }
            recvSize -= Status;

        }while(recvSize > 0);

        LoopCount++;
    }


    Status  = sl_Close(newSockID);
    ASSERT_ON_ERROR(Status);

    Status  = sl_Close(SockID);
    ASSERT_ON_ERROR(Status);

    return SUCCESS;
}

/*!
    \brief This function initializes the application variables

    \param[in]  None

    \return     0 on success, negative error-code on error
*/
static _i32 initializeAppVariables()
{
    g_Status = 0;
    pal_Memset(uBuf.BsdBuf, 0, sizeof(uBuf));

    return SUCCESS;
}

/*!
    \brief This function displays the application's banner

    \param      None

    \return     None
*/
static void displayBanner()
{
    CLI_Write("\n\r\n\r");
    CLI_Write(" NWP filters application - Version ");
    CLI_Write(APPLICATION_VERSION);
    CLI_Write("\n\r*******************************************************************************\n\r");
}

